Обработки/Reports/_ЖурналКонфликтаИнтересов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЖурналКонфликтаИнтересов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДепозиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьРазделыПоАффилированнымЛицам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДанныеПредоставляемыеЮрФизЛицами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьРазделыПоСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСовместноеВладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЖурналКонфликтаИнтересов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	Отчет.Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьОтборов();
	РежимОтбораПриИзменении(Неопределено);
	ЗаполнитьСписокКлиентов(Неопределено);
	
КонецПроцедуры


#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьСписокКлиентов(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	УстановитьВидимостьОтборов();
	
	ТекВидДоговора = ЭтаФорма.ВидДоговораДоверительногоУправления;
	
	Если ЭтаФорма.РежимОтбора = 0 И Не ТипЗнч(ТекВидДоговора) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
		
		Если ТипЗнч(ТекВидДоговора) = Тип("СписокЗначений") И ТекВидДоговора.Количество() > 0 Тогда
			ЭтаФорма.ВидДоговораДоверительногоУправления = ЭтаФорма.ВидДоговораДоверительногоУправления[0].Значение;
		Иначе
			ЭтаФорма.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка");
		КонецЕсли; 
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 1 И Не ТипЗнч(ТекВидДоговора) = Тип("СписокЗначений") Тогда
		
		ЭтаФорма.ВидДоговораДоверительногоУправления = Новый СписокЗначений;
		ЭтаФорма.ВидДоговораДоверительногоУправления.ТипЗначения = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления");
		ЭтаФорма.ВидДоговораДоверительногоУправления.Добавить(ТекВидДоговора);
		
	КонецЕсли; 
	
	ЗаполнитьСписокКлиентов(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораДоверительногоУправленияПриИзменении(Элемент)
	ЗаполнитьСписокКлиентов(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКлиентовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	НоваяСтрока = Отчет.ТаблицаКлиентов.Добавить();
	НоваяСтрока.СчетДоверительногоУправления = ВыбранноеЗначение;
	
КонецПроцедуры


#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	СформироватьНаСервере();
	Элементы.ГруппаТаблицаКлиентов.Скрыть();
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ОбъектыИСделки);
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.АффилированныеЛица);
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.СовместноеВладение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКлиентов(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьСписокКлиентовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура("РежимВыбора, ЗакрыватьПриЗакрытииВладельца, ЗакрыватьПриВыборе", Истина, Истина, Ложь);
	ОткрытьФормуМодально("Справочник.СчетаДоверительногоУправления.Форма.ФормаСписка", ПараметрыФормы, Элементы.ТаблицаКлиентов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СоздатьДокументыНаСервере();
	ОповеститьОбИзменении(Тип("ДокументСсылка.СлужебноеРасследование"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ИзменитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьВExcel(Команда)
	
	СтруктураОтчета = Новый Структура("ОбъектыИСделки, СовместноеВладение, АффилированныеЛица");
	ЗаполнитьЗначенияСвойств(СтруктураОтчета, ЭтаФорма);
	
	ПараметрыФормы = Новый Структура("АдресСтруктурыОтчетов", 
		ПоместитьВоВременноеХранилище(СтруктураОтчета, ЭтаФорма.УникальныйИдентификатор));
	
	ОткрытьФормуМодально("ВнешнийОтчет._ЖурналКонфликтаИнтересов.Форма.ФормаНастроекВыгрузки", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ОбъектыИСделки, 		"НЕАКТУАЛЬНОСТЬ");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.АффилированныеЛица, 	"НЕАКТУАЛЬНОСТЬ");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.СовместноеВладение, 	"НЕАКТУАЛЬНОСТЬ");
	ЭтаФорма.СделкиКАнализу.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	Результат = ОтчетНаСервере.СформироватьОтчет();
	
	ЭтаФорма.ОбъектыИСделки 	= Результат.ОбъектыИСделки;
	ЭтаФорма.СовместноеВладение = Результат.СовместноеВладение;
	ЭтаФорма.АффилированныеЛица = Результат.АффилированныеЛица;
	
	ЭтаФорма.СделкиКАнализу.Очистить();
	
	Для каждого СтрокаКонфликтныеДепозиты Из Результат.КонфликтныеДепозиты Цикл
		
		РеквизитыКонфликта = Новый Структура("Банк, СрокДепозита, ОбстоятельствоВозникновенияКонфликтаИнтересов, ДатаПолученияИнформации");
		ЗаполнитьЗначенияСвойств(РеквизитыКонфликта, СтрокаКонфликтныеДепозиты);
		РеквизитыКонфликта.Вставить("Дата", СтрокаКонфликтныеДепозиты.ДатаЗаключенияДоговора);
		РеквизитыКонфликта.Вставить("КонфликтныеСделки", СтрокаКонфликтныеДепозиты.ДепозитныеВклады);
		
		СрокДепозита = СтрокаСЧислом("; %1 день; ; %1 дня; %1 дней; %1 дня", СтрокаКонфликтныеДепозиты.СрокДепозита, ВидЧисловогоЗначения.Количественное, "L=ru");
		Представление = СтрШаблон("Депозитный вклад: %1 на %2.", 
			СтрокаКонфликтныеДепозиты.Банк, 
			СрокДепозита);
		
		РеквизитыКонфликта.Вставить("ОбстоятельствоВозникновенияКонфликтаИнтересов", Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.ДепозитныйВклад);
		
		НоваяСтрока = ЭтаФорма.СделкиКАнализу.Добавить();
		
		НоваяСтрока.СоздатьДокумент = Истина;
		НоваяСтрока.Дата = СтрокаКонфликтныеДепозиты.ДатаЗаключенияДоговора;
		НоваяСтрока.ДатаПолученияИнформации = СтрокаКонфликтныеДепозиты.ДатаПолученияИнформации;
		НоваяСтрока.Представление = Представление;
		НоваяСтрока.РеквизитыКонфликта = РеквизитыКонфликта;
	
	КонецЦикла; 
	
	Для каждого СтрокаКонфликтныеСделки Из Результат.КонфликтныеСделки Цикл
		
		РеквизитыКонфликта = Новый Структура("Дата, Операция, Рынок, ЦеннаяБумага, СрокРЕПО, ОбстоятельствоВозникновенияКонфликтаИнтересов, ДатаПолученияИнформации");
		ЗаполнитьЗначенияСвойств(РеквизитыКонфликта, СтрокаКонфликтныеСделки);
		РеквизитыКонфликта.Вставить("КонфликтныеСделки", СтрокаКонфликтныеСделки.Сделки);
		
		ПредставлениеРЕПО = ", ";
		Если СтрокаКонфликтныеСделки.СрокРЕПО > 0 Тогда
			ПредставлениеРЕПО = " РЕПО, на срок: "
				+ СтрокаСЧислом("; %1 день; ; %1 дня; %1 дней; %1 дня", СтрокаКонфликтныеСделки.СрокРЕПО, ВидЧисловогоЗначения.Количественное, "L=ru") + ", ";
			//СтрШаблон(" РЕПО, на срок: %1 дней, ", СтрокаКонфликтныеСделки.СрокРЕПО);
			РеквизитыКонфликта.Вставить("ОбстоятельствоВозникновенияКонфликтаИнтересов", Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.СделкаРЕПО);
		Иначе
			РеквизитыКонфликта.Вставить("ОбстоятельствоВозникновенияКонфликтаИнтересов", Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.Сделка);
		КонецЕсли; 
		
		Представление = Строка(СтрокаКонфликтныеСделки.Операция) + ПредставлениеРЕПО + РаботаСОтчетами.ПолучитьПредставлениеЦеннойБумаги(СтрокаКонфликтныеСделки.ЦеннаяБумага, Отчет.Период.ДатаОкончания);
		
		НоваяСтрока = ЭтаФорма.СделкиКАнализу.Добавить();
		
		НоваяСтрока.СоздатьДокумент = Истина;
		НоваяСтрока.Дата = СтрокаКонфликтныеСделки.Дата;
		НоваяСтрока.ДатаПолученияИнформации = СтрокаКонфликтныеСделки.ДатаПолученияИнформации;
		НоваяСтрока.Представление = Представление;
		НоваяСтрока.РеквизитыКонфликта = РеквизитыКонфликта;
	
	КонецЦикла; 
	
	ЭтаФорма.СделкиКАнализу.Сортировать("Дата, Представление");
	
	Для каждого СтрокаКонфликтныеЦенныеБумаги Из Результат.КонфликтныеЦенныеБумаги Цикл
	
		РеквизитыКонфликта = Новый Структура("Дата, ДатаПолученияИнформации, ОбстоятельствоВозникновенияКонфликтаИнтересов");
		ЗаполнитьЗначенияСвойств(РеквизитыКонфликта, СтрокаКонфликтныеЦенныеБумаги);
		РеквизитыКонфликта.Вставить("КонфликтныеСделки", СтрокаКонфликтныеЦенныеБумаги.ЦенныеБумаги);
		РеквизитыКонфликта.Вставить("ОбстоятельствоВозникновенияКонфликтаИнтересов", Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.СовместноеВладение);
		
		НоваяСтрока = ЭтаФорма.СделкиКАнализу.Добавить();
		
		НоваяСтрока.СоздатьДокумент = Истина;
		НоваяСтрока.Дата = СтрокаКонфликтныеЦенныеБумаги.Дата;
		НоваяСтрока.ДатаПолученияИнформации = СтрокаКонфликтныеЦенныеБумаги.ДатаПолученияИнформации;
		НоваяСтрока.Представление = "Совместное владение ценными бумагами";
		НоваяСтрока.РеквизитыКонфликта = РеквизитыКонфликта;
	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКлиентовНаСервере()

	Если ЭтаФорма.РежимОтбора <> 2 Тогда
	
		ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
		Отчет.ТаблицаКлиентов.Загрузить(ОтчетНаСервере.ПолучитьТаблицуКлиентов(ЭтаФорма.ВидДоговораДоверительногоУправления));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьОтборов()

	ЭтоПроизвольныйОтбор = (ЭтаФорма.РежимОтбора = 2);
	
	Элементы.ВидДоговораДоверительногоУправления.Видимость = Не ЭтоПроизвольныйОтбор;
	
	Элементы.ТаблицаКлиентовПодбор.Доступность 		= ЭтоПроизвольныйОтбор;
	Элементы.ТаблицаКлиентов.ИзменятьПорядокСтрок 	= ЭтоПроизвольныйОтбор;
	Элементы.ТаблицаКлиентов.ИзменятьСоставСтрок 	= ЭтоПроизвольныйОтбор;

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	НайденныеСтроки = ЭтаФорма.СделкиКАнализу.НайтиСтроки(Новый Структура("СоздатьДокумент", Истина));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(РеквизитФормыВЗначение("Отчет"), "Период,Организация"); 
	Механизм = "ВнешнийОтчет._ЖурналКонфликтаИнтересов.Форма.СоздатьДокументыНаСервере()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);

	Для каждого ТекСтрока Из НайденныеСтроки Цикл
		Если СоздатьДокумент(ТекСтрока) Тогда
			ЭтаФорма.СделкиКАнализу.Удалить(ТекСтрока);
		КонецЕсли; 
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокумент(ТекСтрока)

	РеквизитыКонфликта = ТекСтрока.РеквизитыКонфликта;
	
	Документ = Документы.СлужебноеРасследование.СоздатьДокумент();
	Документ.Заполнить(Неопределено);
	
	Документ.Статус 					= Перечисления.СтатусыСлужебныхРасследований.НаРассмотрении;
	Документ.Дата 						= РеквизитыКонфликта.ДатаПолученияИнформации;
	
	ЗаполнитьЗначенияСвойств(Документ, РеквизитыКонфликта, , "Дата");
	
	Если Документ.ОбстоятельствоВозникновенияКонфликтаИнтересов = Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.ДепозитныйВклад Тогда
		Документ.ДатаЗаключенияДоговора = РеквизитыКонфликта.Дата;
		Для каждого РеквизитыДепозитногоВклада Из РеквизитыКонфликта.КонфликтныеСделки Цикл
			ЗаполнитьЗначенияСвойств(Документ.ИнформацияОКонфликте.Добавить(), РеквизитыДепозитногоВклада);
		КонецЦикла; 
	ИначеЕсли Документ.ОбстоятельствоВозникновенияКонфликтаИнтересов = Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.СовместноеВладение Тогда	
		Документ.ДатаСделки = РеквизитыКонфликта.Дата;
		Для каждого РеквизитыЦенныхБумаг Из РеквизитыКонфликта.КонфликтныеСделки Цикл
			ЗаполнитьЗначенияСвойств(Документ.ЦенныеБумаги.Добавить(), РеквизитыЦенныхБумаг);
		КонецЦикла; 
	Иначе // сделки
		Документ.ДатаСделки = РеквизитыКонфликта.Дата;
		Документ.ВидСделки = РеквизитыКонфликта.Операция;
		Для каждого РеквизитыСделки Из РеквизитыКонфликта.КонфликтныеСделки Цикл
			ЗаполнитьЗначенияСвойств(Документ.ИнформацияОКонфликте.Добавить(), РеквизитыСделки);
		КонецЦикла; 
	КонецЕсли; 
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки; 	
	
КонецФункции

&НаКлиенте
Процедура ИзменитьФлажки(Значение)

	Если Элементы.СделкиКАнализу.ВыделенныеСтроки.Количество() > 1 Тогда
		Для каждого ИдентификаторСтроки Из Элементы.СделкиКАнализу.ВыделенныеСтроки Цикл
			ТекСтрока = ЭтаФорма.СделкиКАнализу.НайтиПоИдентификатору(ИдентификаторСтроки);
			ТекСтрока.СоздатьДокумент = Значение;
		КонецЦикла; 
	Иначе
		Для каждого ТекСтрока Из ЭтаФорма.СделкиКАнализу Цикл
			ТекСтрока.СоздатьДокумент = Значение;
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
		
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
